A copy of the config is here:

```
module "pubsub-01" {
  source     = "git::https://github.com/terraform-google-modules/terraform-google-pubsub.git?ref=v2.0.0"
  project_id = var.project_id
  topic      = var.topics[0]

  pull_subscriptions = [
    {
      name                 = "test1"
      expiration_policy    = ""
      ack_deadline_seconds = 20
    },
    {
      name                 = "test1"
      expiration_policy    = ""
      ack_deadline_seconds = 20
    },
  ]
}
# ...so on and so forth for each of the topics in the variables of "topics".  Not looped
module "pubsub-02" {
  source     = "git::https://github.com/terraform-google-modules/terraform-google-pubsub.git?ref=v2.0.0"
  project_id = var.project_id
  topic      = var.topics[0]

  pull_subscriptions = [
    {
      name                 = "test2"
      expiration_policy    = ""
      ack_deadline_seconds = 20
    },
    {
      name                 = "test2"
      expiration_policy    = ""
      ack_deadline_seconds = 20
    },
  ]
}
```

Inside of variables.tf:

```
variable "topics" {
  description = "Metadata Topics"
  type        = list(any)
  default     = ["test1", "test2", "test3", "test4", "test5"]
}
```

The plan:


```
# module.pubsub-01.google_pubsub_subscription.pull_subscriptions will be destroyed
  - resource "google_pubsub_subscription" "pull_subscriptions" {
      - ack_deadline_seconds       = 20 -> null
      - enable_message_ordering    = false -> null
      - id                         = "projects/myproject/subscriptions/test1" -> null
      - labels                     = {} -> null
      - message_retention_duration = "604800s" -> null
      - name                       = "test1" -> null
      - path                       = "projects/myproject/subscriptions/test1" -> null
      - project                    = "myproject" -> null
      - retain_acked_messages      = false -> null
      - topic                      = "projects/myproject/topics/schema" -> null

      - expiration_policy {}
    }

  # module.pubsub-01.google_pubsub_subscription.pull_subscriptions[1] will be destroyed
  - resource "google_pubsub_subscription" "pull_subscriptions" {
      - ack_deadline_seconds       = 20 -> null
      - enable_message_ordering    = false -> null
      - id                         = "projects/myproject/subscriptions/test2" -> null
      - labels                     = {} -> null
      - message_retention_duration = "604800s" -> null
      - name                       = "test2" -> null
      - path                       = "projects/myproject/subscriptions/test2" -> null
      - project                    = "myproject" -> null
      - retain_acked_messages      = false -> null
      - topic                      = "projects/myproject/topics/schema" -> null

      - expiration_policy {}
    }

  # module.pubsub-01.google_pubsub_subscription.pull_subscriptions["test1"] will be created
  + resource "google_pubsub_subscription" "pull_subscriptions" {
      + ack_deadline_seconds       = 20
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "test1"
      + path                       = (known after apply)
      + project                    = "myproject"
      + topic                      = "schema"

      + expiration_policy {}
    }

  # module.pubsub-01.google_pubsub_subscription.pull_subscriptions["test2"] will be created
  + resource "google_pubsub_subscription" "pull_subscriptions" {
      + ack_deadline_seconds       = 20
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "test2"
      + path                       = (known after apply)
      + project                    = "myproject"
      + topic                      = "schema"

      + expiration_policy {}
    }

  # module.pubsub-01.google_pubsub_subscription_iam_member.pull_subscription_binding will be destroyed
  - resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      - etag         = "BwXApy5W2/Q=" -> null
      - id           = "projects/myproject/subscriptions/test1/roles/pubsub.subscriber/serviceaccount:service-123412341234@gcp-sa-pubsub.iam.gserviceaccount.com" -> null
      - member       = "serviceAccount:service-123412341234@gcp-sa-pubsub.iam.gserviceaccount.com" -> null
      - project      = "myproject" -> null
      - role         = "roles/pubsub.subscriber" -> null
      - subscription = "test1" -> null
    }

  # module.pubsub-01.google_pubsub_subscription_iam_member.pull_subscription_binding[1] will be destroyed
  - resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      - etag         = "BwXApy5SJ7o=" -> null
      - id           = "projects/myproject/subscriptions/test2/roles/pubsub.subscriber/serviceaccount:service-123412341234@gcp-sa-pubsub.iam.gserviceaccount.com" -> null
      - member       = "serviceAccount:service-123412341234@gcp-sa-pubsub.iam.gserviceaccount.com" -> null
      - project      = "myproject" -> null
      - role         = "roles/pubsub.subscriber" -> null
      - subscription = "test2" -> null
    }

  # module.pubsub-01.google_pubsub_subscription_iam_member.pull_subscription_binding["test1"] will be created
  + resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-123412341234@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "myproject"
      + role         = "roles/pubsub.subscriber"
      + subscription = "test1"
    }

  # module.pubsub-01.google_pubsub_subscription_iam_member.pull_subscription_binding["test2"] will be created
  + resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-123412341234@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "myproject"
      + role         = "roles/pubsub.subscriber"
      + subscription = "test2"
    }

  # module.pubsub-01.google_pubsub_topic_iam_member.pull_topic_binding will be destroyed
  - resource "google_pubsub_topic_iam_member" "pull_topic_binding" {
      - etag    = "BwXApy4NRek=" -> null
      - id      = "projects/myproject/topics/schema/roles/pubsub.publisher/serviceaccount:service-123412341234@gcp-sa-pubsub.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:service-123412341234@gcp-sa-pubsub.iam.gserviceaccount.com" -> null
      - project = "myproject" -> null
      - role    = "roles/pubsub.publisher" -> null
      - topic   = "projects/myproject/topics/schema" -> null
    }

  # module.pubsub-01.google_pubsub_topic_iam_member.pull_topic_binding[1] will be destroyed
  - resource "google_pubsub_topic_iam_member" "pull_topic_binding" {
      - etag    = "BwXApy4NRek=" -> null
      - id      = "projects/myproject/topics/schema/roles/pubsub.publisher/serviceaccount:service-123412341234@gcp-sa-pubsub.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:service-123412341234@gcp-sa-pubsub.iam.gserviceaccount.com" -> null
      - project = "myproject" -> null
      - role    = "roles/pubsub.publisher" -> null
      - topic   = "projects/myproject/topics/schema" -> null
    }

  # module.pubsub-01.google_pubsub_topic_iam_member.pull_topic_binding["test1"] will be created
  + resource "google_pubsub_topic_iam_member" "pull_topic_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-123412341234@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project = "myproject"
      + role    = "roles/pubsub.publisher"
      + topic   = "projects/myproject/topics/schema"
    }

  # module.pubsub-01.google_pubsub_topic_iam_member.pull_topic_binding["test2"] will be created
  + resource "google_pubsub_topic_iam_member" "pull_topic_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-123412341234@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project = "myproject"
      + role    = "roles/pubsub.publisher"
      + topic   = "projects/myproject/topics/schema"
    }

  # module.pubsub-02.google_pubsub_subscription.pull_subscriptions will be destroyed
  - resource "google_pubsub_subscription" "pull_subscriptions" {
      - ack_deadline_seconds       = 20 -> null
      - enable_message_ordering    = false -> null
      - id                         = "projects/myproject/subscriptions/1-application" -> null
      - labels                     = {} -> null
      - message_retention_duration = "604800s" -> null
      - name                       = "1-application" -> null
      - path                       = "projects/myproject/subscriptions/1-application" -> null
      - project                    = "myproject" -> null
      - retain_acked_messages      = false -> null
      - topic                      = "projects/myproject/topics/application" -> null

      - expiration_policy {}
    }

  # module.pubsub-02.google_pubsub_subscription.pull_subscriptions[1] will be destroyed
  - resource "google_pubsub_subscription" "pull_subscriptions" {
      - ack_deadline_seconds       = 20 -> null
      - enable_message_ordering    = false -> null
      - id                         = "projects/myproject/subscriptions/2-application" -> null
      - labels                     = {} -> null
      - message_retention_duration = "604800s" -> null
      - name                       = "2-application" -> null
      - path                       = "projects/myproject/subscriptions/2-application" -> null
      - project                    = "myproject" -> null
      - retain_acked_messages      = false -> null
      - topic                      = "projects/myproject/topics/application" -> null

      - expiration_policy {}
    }

  # module.pubsub-02.google_pubsub_subscription.pull_subscriptions["1-application"] will be created
  + resource "google_pubsub_subscription" "pull_subscriptions" {
      + ack_deadline_seconds       = 20
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "1-application"
      + path                       = (known after apply)
      + project                    = "myproject"
      + topic                      = "application"

      + expiration_policy {}
    }

  # module.pubsub-02.google_pubsub_subscription.pull_subscriptions["2-application"] will be created
  + resource "google_pubsub_subscription" "pull_subscriptions" {
      + ack_deadline_seconds       = 20
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "2-application"
      + path                       = (known after apply)
      + project                    = "myproject"
      + topic                      = "application"

      + expiration_policy {}
    }

  # module.pubsub-02.google_pubsub_subscription_iam_member.pull_subscription_binding will be destroyed
  - resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      - etag         = "BwXApy4F6OE=" -> null
      - id           = "projects/myproject/subscriptions/1-application/roles/pubsub.subscriber/serviceaccount:service-123412341234@gcp-sa-pubsub.iam.gserviceaccount.com" -> null
      - member       = "serviceAccount:service-123412341234@gcp-sa-pubsub.iam.gserviceaccount.com" -> null
      - project      = "myproject" -> null
      - role         = "roles/pubsub.subscriber" -> null
      - subscription = "1-application" -> null
    }

  # module.pubsub-02.google_pubsub_subscription_iam_member.pull_subscription_binding[1] will be destroyed
  - resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      - etag         = "BwXApy4HWYQ=" -> null
      - id           = "projects/myproject/subscriptions/2-application/roles/pubsub.subscriber/serviceaccount:service-123412341234@gcp-sa-pubsub.iam.gserviceaccount.com" -> null
      - member       = "serviceAccount:service-123412341234@gcp-sa-pubsub.iam.gserviceaccount.com" -> null
      - project      = "myproject" -> null
      - role         = "roles/pubsub.subscriber" -> null
      - subscription = "2-application" -> null
    }

  # module.pubsub-02.google_pubsub_subscription_iam_member.pull_subscription_binding["1-application"] will be created
  + resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-123412341234@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "myproject"
      + role         = "roles/pubsub.subscriber"
      + subscription = "1-application"
    }

  # module.pubsub-02.google_pubsub_subscription_iam_member.pull_subscription_binding["2-application"] will be created
  + resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-123412341234@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "myproject"
      + role         = "roles/pubsub.subscriber"
      + subscription = "2-application"
    }

  # module.pubsub-02.google_pubsub_topic_iam_member.pull_topic_binding will be destroyed
  - resource "google_pubsub_topic_iam_member" "pull_topic_binding" {
      - etag    = "BwXApy22N5A=" -> null
      - id      = "projects/myproject/topics/application/roles/pubsub.publisher/serviceaccount:service-123412341234@gcp-sa-pubsub.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:service-123412341234@gcp-sa-pubsub.iam.gserviceaccount.com" -> null
      - project = "myproject" -> null
      - role    = "roles/pubsub.publisher" -> null
      - topic   = "projects/myproject/topics/application" -> null
    }

  # module.pubsub-02.google_pubsub_topic_iam_member.pull_topic_binding[1] will be destroyed
  - resource "google_pubsub_topic_iam_member" "pull_topic_binding" {
      - etag    = "BwXApy22N5A=" -> null
      - id      = "projects/myproject/topics/application/roles/pubsub.publisher/serviceaccount:service-123412341234@gcp-sa-pubsub.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:service-123412341234@gcp-sa-pubsub.iam.gserviceaccount.com" -> null
      - project = "myproject" -> null
      - role    = "roles/pubsub.publisher" -> null
      - topic   = "projects/myproject/topics/application" -> null
    }

  # module.pubsub-02.google_pubsub_topic_iam_member.pull_topic_binding["1-application"] will be created
  + resource "google_pubsub_topic_iam_member" "pull_topic_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-123412341234@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project = "myproject"
      + role    = "roles/pubsub.publisher"
      + topic   = "projects/myproject/topics/application"
    }

  # module.pubsub-02.google_pubsub_topic_iam_member.pull_topic_binding["2-application"] will be created
  + resource "google_pubsub_topic_iam_member" "pull_topic_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-123412341234@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project = "myproject"
      + role    = "roles/pubsub.publisher"
      + topic   = "projects/myproject/topics/application"
    }
```

This is from changing the module version from 1.9.0 to 2.0.0.